Revit 2027 API
TextNode.Width Property
 Width [ft] of the area of the text content in model space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Width { get; }
Public ReadOnly Property Width As Double
	Get
public:
property double Width {
	double get ();
}
member Width : float with get
Property Value
Double
Remarks
 Specifies the actual width of the text, that is essentially the width of the longest line, including any spaces. The value represents the width after the width scale has been applied.
See Also
Reference
TextNode Class
Autodesk.Revit.DB Namespace